Revit 2026 API

# BuiltInFailuresFaceSplitterFailures Class

---

Failures about FaceSplitter.

SystemObject Autodesk.Revit.DBBuiltInFailuresFaceSplitterFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class FaceSplitterFailures
```
```vb
Public NotInheritable Class FaceSplitterFailures
```
```cpp
public ref class FaceSplitterFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type FaceSplitterFailures = class end
```

The BuiltInFailuresFaceSplitterFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannotUseCurvesForFaceSplit | The sketch cannot split the face of the highlighted element. |
|  | EndsNotOnEdgeError | Ends of an open loop in sketch splitting face do not lie on an edge of the face to split. |
|  | InvalidClosedLoopsForFaceSplit | The closed loop used to split the face must lie completely within the face and cannot intersect or overlap any of the face's edges. To split a face at its border, use an open loop that ends on the boundary of the face. |
|  | InvalidOpenLoopsForFaceSplit | The open loops used to split the face must lie completely within the face and cannot intersect or overlap any of the face's edges. |
|  | LoopsDoNotSubdivideFace | Sketched loops must sub-divide the face into two or more completely enclosed regions. |
|  | LoopsOutsideFaceSplitError | Some of the lines drawn lie outside of the boundary of the face being split. All lines used to split a face must be contained within the face being split and cannot intersect or overlap any of the boundaries of that face. |
|  | NoFaceForSplit | The highlighted element no longer contains a face that has been split by highlighted sketch. |

#### Reference

Autodesk.Revit.DB Namespace